jonacappelle/nRF52-DCU/main.c
/////////////// LED BUTTON BLINK /////////////////////
void in_pin_handler(nrf_drv_gpiote_pin_t pin, nrf_gpiote_polarity_t action)
{
    nrf_drv_gpiote_out_toggle(PIN_OUT);
	
	/* CHANGES */
	
	NRF_LOG_INFO("BUTTON PRESS");
	
	/* END CHANGES */
}
/**
 * @brief Function for configuring: PIN_IN pin for input, PIN_OUT pin for output,
 * and configures GPIOTE to give an interrupt on pin change.
 */
static void gpio_init(void)
{
    ret_code_t err_code;

    err_code = nrf_drv_gpiote_init();
    APP_ERROR_CHECK(err_code);

    nrf_drv_gpiote_out_config_t out_config = GPIOTE_CONFIG_OUT_SIMPLE(false);

    err_code = nrf_drv_gpiote_out_init(PIN_OUT, &out_config);
    APP_ERROR_CHECK(err_code);

    nrf_drv_gpiote_in_config_t in_config = GPIOTE_CONFIG_IN_SENSE_TOGGLE(true);
    in_config.pull = NRF_GPIO_PIN_PULLUP;

    err_code = nrf_drv_gpiote_in_init(PIN_IN, &in_config, in_pin_handler);
    APP_ERROR_CHECK(err_code);

    nrf_drv_gpiote_in_event_enable(PIN_IN, true);
}
/////////////// LED BUTTON BLINK /////////////////////



int main(void)
{
    // Initialize.
    log_init();
    timer_init();
    uart_init();
    buttons_leds_init();
    db_discovery_init();
    power_management_init();
    ble_stack_init();
    gatt_init();
    nus_c_init();
	
	/* CHANGES ADDED */
	ble_conn_state_init();
	/* END ADDED CHANGES */
	
    scan_init();
	

	
		// BLUE LED as output
		//nrf_gpio_cfg_output(7);

    // Start execution.
    printf("BLE UART central example started.\r\n");
    NRF_LOG_INFO("BLE UART central example started.");
    scan_start();
		
		// TimeSync
		// Start TimeSync AFTER scan_start()
		// This is a temporary fix for a known bug where connection is constantly closed with error code 0x3E
		sync_timer_init();


		/////////////// LED BUTTON BLINK /////////////////////
//		gpio_init();
		/////////////// LED BUTTON BLINK /////////////////////
		
		/* CHANGES */
		// TIMER DIY INIT
		//timer_diy_init();
		/* END CHANGES */

    // Enter main loop.
    for (;;)
    {
//				NRF_LOG_INFO(ts_timestamp_get_ticks_u64());
//			NRF_LOG_INFO("%d", m_params.high_freq_timer[0]->CC[2]);
			NRF_LOG_FLUSH();
        idle_state_handle();			
    }
}

/*
NRF_SDH_BLE_GAP_DATA_LENGTH 251

NRF_SDH_BLE_GAP_EVENT_LENGTH 300

NRF_SDH_BLE_GATT_MAX_MTU_SIZE 247
*/
